cgx_2.17.examples/OpenFOAM/couette/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 288;

boundaryField
{
  in
  {
    type cyclic;
  }

    SYMP3           
    {
        type            empty;
    }

    wall          
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 288;
    }

    slip         
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
